cypress/artillery/jsonplaceholder_test.yml
config:
  target: "https://jsonplaceholder.typicode.com"
  phases:
    - duration: 5
      arrivalRate: 10
      name: "Simple Load Test"
  payload:
    path: "payload.csv"
    fields:
      - title
      - body
      - userId
  plugins:
    ensure:
      thresholds:
        http.response_time.p95: 500 # 95% odpowiedzi musi być < 500ms
        http.codes.200: 90 # co najmniej 90 odpowiedzi z kodem 200
        http.errors: 0 # brak błędów

scenarios:
  - name: "GET and POST requests"
    flow:
      - get:
          url: "/posts/1"
      - post:
          url: "/posts"
          json:
            title: "{{ title }}"
            body: "{{ body }}"
            userId: "{{ userId }}"